# Import Libraries

In [2]:
import pandas as pd 
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_absolute_error, mean_absolute_percentage_error, mean_squared_error,r2_score

# Read Data

In [3]:
house=pd.read_csv("kc_house_data.csv")

#  EDA

In [4]:
house.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [5]:
house.drop(['id','date','waterfront','view','condition','grade','sqft_above','yr_built','yr_renovated','zipcode','lat','long','sqft_living15','sqft_lot15'],axis=1,inplace=True)

In [6]:
house.head()

      price  bedrooms  bathrooms  sqft_living  sqft_lot  floors  sqft_basement
0  221900.0         3       1.00         1180      5650     1.0              0
1  538000.0         3       2.25         2570      7242     2.0            400
2  180000.0         2       1.00          770     10000     1.0              0
3  604000.0         4       3.00         1960      5000     1.0            910
4  510000.0         3       2.00         1680      8080     1.0              0

In [7]:
house.describe()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,sqft_basement
count,2.161300e+04,21613.000000,21613.000000,21613.000000,2.161300e+04,21613.000000,21613.000000
mean,5.400881e+05,3.370842,2.114757,2079.899736,1.510697e+04,1.494309,291.509045
std,3.671272e+05,0.930062,0.770163,918.440897,4.142051e+04,0.539989,442.575043
min,7.500000e+04,0.000000,0.000000,290.000000,5.200000e+02,1.000000,0.000000
25%,3.219500e+05,3.000000,1.750000,1427.000000,5.040000e+03,1.000000,0.000000
50%,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000
75%,6.450000e+05,4.000000,2.500000,2550.000000,1.068800e+04,2.000000,560.000000
max,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,4820.000000

In [8]:
house.isnull().sum()

price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
sqft_basement    0
dtype: int64

In [9]:
house.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          21613 non-null  float64
 1   bedrooms       21613 non-null  int64
 2   bathrooms      21613 non-null  float64
 3   sqft_living    21613 non-null  int64
 4   sqft_lot       21613 non-null  int64
 5   floors         21613 non-null  float64
 6   sqft_basement  21613 non-null  int64
dtypes: float64(3), int64(4)
memory usage: 1.2 MB

In [10]:
y=house['price']
X=house.drop('price',axis=1)

y=y.values.reshape(-1,1)

# Spliting Data

In [11]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((15129, 6), (6484, 6), (15129, 1), (6484, 1))

# Modelling

In [12]:
model = LinearRegression()
model.fit(X_train,y_train)

LinearRegression()

# Prediction

In [13]:
y_pred = model.predict(X_test)

# Ketepatan Model

In [14]:
MAE= mean_absolute_error(y_test,y_pred)
MAP= mean_absolute_percentage_error(y_test,y_pred)
MSE= mean_squared_error(y_test,y_pred)

print('MAE:', MAE)
print('MAP:', MAP)
print('MSE:', MSE)

MAE: 174434.81935704986
MAP: 0.3517412356407336
MSE: 72158986156.21852

# Nilai Koefisen dan Intersep

In [15]:
print('Intercept of the model:',model.intercept_)
print('Coefficient of the line:',model.coef_)

Intercept of the model: [72622.73749089]
Coefficient of the line: [[-5.88619449e+04  5.85232782e+03  3.03948964e+02 -3.61895991e-01
   1.09068446e+04  3.33136797e+01]]